modern-tc32/tlsr82xx/tlsr82xx-pac/svd/tlsr8278.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SWIRE</name>
      <description>Auto-generated from section 'swire'</description>
      <baseAddress>0x8000b0</baseAddress>
      <registers>
        <register>
          <name>SWIRE_DATA</name>
          <description>Auto-generated from swire_data</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>SWIRE_CTRL1</name>
          <description>Auto-generated from swire_ctrl1</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_SWIRE_WR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_SWIRE_RD</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_SWIRE_CMD</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_SWIRE_USB_DET</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_SWIRE_USB_EN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SWIRE_CLK_DIV</name>
          <description>Auto-generated from swire_clk_div</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_SWIRE_CLK_DIV</name>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SWIRE_ID</name>
          <description>Auto-generated from swire_id</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_SWIRE_ID_SLAVE_ID</name>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>FLD_SWIRE_ID_SLAVE_FIFO_EN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ANALOG_CONTROL</name>
      <description>Auto-generated from section 'analog control'</description>
      <baseAddress>0x8000b8</baseAddress>
      <registers>
        <register>
          <name>ANA_CTRL32</name>
          <description>Auto-generated from ana_ctrl32; aliases: ANA_ADDR, ANA_ADDR_DATA</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>ANA_DATA</name>
          <description>Auto-generated from ana_data</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ANA_CTRL</name>
          <description>Auto-generated from ana_ctrl</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_ANA_BUSY</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_ANA_RSV</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_ANA_RW</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_ANA_START</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_ANA_CYC</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>I2C_ADDRESS_MAP</name>
      <description>Auto-generated from section 'i2c address map'</description>
      <baseAddress>0x8000e0</baseAddress>
      <registers>
        <register>
          <name>I2C_MAP_HADR</name>
          <description>Auto-generated from i2c_map_hadr</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>I2C_SLAVE_MAP_ADDRL</name>
          <description>Auto-generated from i2c_slave_map_addrl</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>I2C_SLAVE_MAP_ADDRM</name>
          <description>Auto-generated from i2c_slave_map_addrm</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>I2C_SLAVE_MAP_ADDRH</name>
          <description>Auto-generated from i2c_slave_map_addrh</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>I2C_SLAVE_IRQ_STATUS</name>
          <description>Auto-generated from i2c_slave_irq_status; aliases: I2C_MAP_HOST_STATUS, SPI_SLAVE_IRQ_STATUS</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_HOST_CMD_IRQ</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_SLAVE_SPI_IRQ</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_HOST_READ_IRQ</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_MAP_READ0</name>
          <description>Auto-generated from i2c_map_read0</description>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>I2C_MAP_READ1</name>
          <description>Auto-generated from i2c_map_read1</description>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>I2C_MAP_READ2</name>
          <description>Auto-generated from i2c_map_read2</description>
          <addressOffset>0x7</addressOffset>
          <size>8</size>
        </register>
