modern-tc32/tlsr82xx/tlsr82xx-pac/svd/tlsr8278.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FIFO</name>
      <description>Auto-generated from section 'fifo'</description>
      <baseAddress>0x800800</baseAddress>
      <registers>
        <register>
          <name>FIFO0_DATA</name>
          <description>Auto-generated from fifo0_data</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FIFO1_DATA</name>
          <description>Auto-generated from fifo1_data</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>FIFO2_DATA</name>
          <description>Auto-generated from fifo2_data</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DFIFO</name>
      <description>Auto-generated from section 'dfifo'</description>
      <baseAddress>0x800b00</baseAddress>
      <registers>
        <register>
          <name>DFIFO0_ADDR</name>
          <description>Auto-generated from dfifo0_addr</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DFIFO0_SIZE</name>
          <description>Auto-generated from dfifo0_size</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DFIFO1_ADDR</name>
          <description>Auto-generated from dfifo1_addr</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DFIFO1_SIZE</name>
          <description>Auto-generated from dfifo1_size</description>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DFIFO2_ADDR</name>
          <description>Auto-generated from dfifo2_addr</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DFIFO2_SIZE</name>
          <description>Auto-generated from dfifo2_size</description>
          <addressOffset>0xa</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DFIFO_MODE</name>
          <description>Auto-generated from dfifo_mode</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_AUD_DFIFO0_IN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DFIFO1_IN</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DFIFO2_IN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DFIFO0_OUT</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DFIFO0_L_INT</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DFIFO0_H_INT</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DFIFO1_H_INT</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DFIFO2_H_INT</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFIFO_AIN</name>
          <description>Auto-generated from dfifo_ain</description>
          <addressOffset>0x11</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_AUD_SAMPLE_TIME_CONFIG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_FIFO0_INPUT_SELECT</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_FIFO1_INPUT_SELECT</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_MIC_LEFT_CHN_SELECT</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_MIC_RIGHT_CHN_SELECT</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MIC_CTRL</name>
          <description>Auto-generated from mic_ctrl</description>
          <addressOffset>0x12</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_AUD_MIC_VOL_CONTROL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_MIC_MONO_EN</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_AMIC_DMIC_SELECT</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFIFO_IRQ_STATUS</name>
          <description>Auto-generated from dfifo_irq_status</description>
          <addressOffset>0x13</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_AUD_DFIFO0_L_IRQ_FLAG</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DFIFO0_H_IRQ_FLAG</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DFIFO1_H_IRQ_FLAG</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DFIFO2_H_IRQ_FLAG</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DFIFO0_L_IRQ</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DFIFO0_H_IRQ</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DFIFO1_H_IRQ</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLD_AUD_DFIFO2_H_IRQ</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFIFO0_RPTR</name>
          <description>Auto-generated from dfifo0_rptr</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DFIFO0_WPTR</name>
          <description>Auto-generated from dfifo0_wptr</description>
          <addressOffset>0x16</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DFIFO1_RPTR</name>
          <description>Auto-generated from dfifo1_rptr</description>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DFIFO1_WPTR</name>
          <description>Auto-generated from dfifo1_wptr</description>
          <addressOffset>0x1a</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DFIFO2_RPTR</name>
          <description>Auto-generated from dfifo2_rptr</description>
          <addressOffset>0x1c</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DFIFO2_WPTR</name>
          <description>Auto-generated from dfifo2_wptr</description>
          <addressOffset>0x1e</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DFIFO0_NUM</name>
          <description>Auto-generated from dfifo0_num</description>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DFIFO1_NUM</name>
          <description>Auto-generated from dfifo1_num</description>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DFIFO2_NUM</name>
          <description>Auto-generated from dfifo2_num</description>
          <addressOffset>0x28</addressOffset>
          <size>16</size>
        </register>
        <register>
          <name>DFIFO_MANUAL_MODE</name>
          <description>Auto-generated from dfifo_manual_mode</description>
          <addressOffset>0x2c</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_DFIFO_MANUAL_MODE_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFIFO0_MAN_DAT</name>
          <description>Auto-generated from dfifo0_man_dat</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>SET_FILTER_PARA</name>
          <description>Auto-generated from set_filter_para</description>
          <addressOffset>0x80</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>DFIFO_DEC_RATIO</name>
          <description>Auto-generated from dfifo_dec_ratio</description>
          <addressOffset>0x8a</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>CODEC_DEC_EN</name>
          <description>Auto-generated from codec_dec_en</description>
          <addressOffset>0x8b</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLD_AUD_CODEC_DEC_EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
